---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterSlot.MakeEmpty
source: html/a3e78a12-1414-efc0-f0af-b2e7ac904e1e.htm
---
# Autodesk.Revit.DB.ComponentRepeaterSlot.MakeEmpty Method

Makes the slot empty by removing the instance currently held by the slot.

## Syntax (C#)
```csharp
public void MakeEmpty()
```